PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_smif.c
/***************************************************************************//**
* \file cy_smif.c
* \version 2.130
*
* \brief
*  This file provides the source code for the SMIF driver APIs.
*
* Note:
*
********************************************************************************
* \copyright
* Copyright 2016-2025 Cypress Semiconductor Corporation (an Infineon company) or
* an affiliate of Cypress Semiconductor Corporation.
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

#include "cy_device.h"

#if defined (CY_IP_MXSMIF)

#include "cy_smif.h"
#include "cy_sysclk.h"
#if defined(CY_USE_RPC_CALL) && (CY_USE_RPC_CALL == 1) && (CY_IP_MXSMIF_VERSION >= 6U) && !defined (COMPONENT_SECURE_DEVICE)
    #include "cy_secure_services.h"
#endif

#if defined(__cplusplus)
extern "C" {
#endif

/*******************************************************************************
* Function Name: Cy_SMIF_Init
****************************************************************************//**
*
* This function initializes the SMIF block as a communication block. The user
* must ensure that the SMIF interrupt is disabled while this function
* is called. Enabling the interrupts can lead to triggering in the middle
* of the initialization operation, which can lead to erroneous initialization.
*
* As parameters, this function takes the SMIF register base address and a
* context structure along with the configuration needed for the SMIF block,
* stored in a config.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param config
* Passes a configuration structure that configures the SMIF block for operation.
*
* \param timeout
* A timeout in microseconds for blocking APIs in use.
*
* \param context
* Passes a configuration structure that contains the transfer parameters of the
* SMIF block.
*
* \note Make sure that the interrupts are initialized and disabled.
*
* \return
*     - \ref CY_SMIF_BAD_PARAM
*     - \ref CY_SMIF_SUCCESS
*
*******************************************************************************/
cy_en_smif_status_t Cy_SMIF_Init(SMIF_Type *base,
                                 cy_stc_smif_config_t const *config,
                                 uint32_t timeout,
                                 cy_stc_smif_context_t *context)
{
    cy_en_smif_status_t result = CY_SMIF_SUCCESS;

    /* Ensure none of the input pointers are null. */
    if ((NULL == base) || (NULL == config) || (NULL == context))
    {
        return CY_SMIF_BAD_PARAM;
    }

    /* Check config structure */
    CY_ASSERT_L3(CY_SMIF_MODE_VALID(config->mode));
    CY_ASSERT_L3(CY_SMIF_BLOCK_EVENT_VALID(config->blockEvent));
    CY_ASSERT_L2(CY_SMIF_DESELECT_DELAY_VALID(config->deselectDelay));
#if ((CY_IP_MXSMIF_VERSION == 2) && (CY_IP_MXSMIF_VERSION == 3))
    CY_ASSERT_L3(CY_SMIF_CLOCK_SEL_VALID(config->rxClockSel));
#endif

#if (CY_IP_MXSMIF_VERSION == 4)
    /* Ensure SMIFv4 uses DLL, as SMIFv4 use of the DLL is mandatory and cannot be bypassed. */
    if (config->enable_internal_dll != true)
    {
        return CY_SMIF_BAD_PARAM;
    }
    /* SMIFv4 initializes the SMIF bridge to be ON by default.  Bridge support is not yet present
       in this driver, so it needs to be manually turned off. */
    result = Cy_SMIF_Bridge_Enable(SMIF0, false);
#endif

    /* Initialize context parameters */
    context->txBufferAddress = NULL;
    context->txBufferSize = 0U;
    context->txBufferCounter = 0U;
    context->rxBufferAddress = NULL;
    context->rxBufferSize = 0U;
    context->rxBufferCounter = 0U;
    context->transferStatus = CY_SMIF_STARTED;
    context->txCompleteCb = NULL;
    context->rxCompleteCb = NULL;
    context->timeout = timeout;
    context->memReadyPollDelay = 0U;
#if (CY_IP_MXSMIF_VERSION >= 2)
    context->preCmdDataRate = CY_SMIF_SDR;
    context->preCmdWidth = CY_SMIF_WIDTH_SINGLE;
    context->preXIPDataRate = CY_SMIF_SDR;
    context->dummyCycles = 0U;
    context->flags = 0U;
#endif

    /* The SMIF CTL and CTL2 registers cannot be modified while the SMIF is enabled in XIP mode. */
    uint32_t smif_ctl_value = SMIF_CTL(base);
    if (!((_FLD2VAL(SMIF_CTL_ENABLED, smif_ctl_value) == 1U) && (_FLD2VAL(SMIF_CTL_XIP_MODE, smif_ctl_value) == 1U)))
    {
        /* Construct the SMIF CTL register value, starting from register defaults. */
        uint32_t tmp_ctl = CY_SMIF_CTL_REG_DEFAULT;


        /* Configure the initial interrupt mask */
        /* Disable the TR_TX_REQ and TR_RX_REQ interrupts */
        Cy_SMIF_SetInterruptMask(base, Cy_SMIF_GetInterruptMask(base)
                                 & ~(SMIF_INTR_TR_TX_REQ_Msk | SMIF_INTR_TR_RX_REQ_Msk));

        /* Configure the SMIF interface */
        tmp_ctl = _CLR_SET_FLD32U(tmp_ctl, SMIF_CTL_XIP_MODE, config->mode);
        tmp_ctl = _CLR_SET_FLD32U(tmp_ctl, SMIF_CTL_BLOCK, config->blockEvent);
        tmp_ctl = _CLR_SET_FLD32U(tmp_ctl, SMIF_CTL_DESELECT_DELAY, config->deselectDelay);
#if (CY_IP_MXSMIF_VERSION <= 3)
        tmp_ctl = _CLR_SET_FLD32U(tmp_ctl, SMIF_CTL_CLOCK_IF_RX_SEL, config->rxClockSel);
#endif
#if ((CY_IP_MXSMIF_VERSION == 2) || (CY_IP_MXSMIF_VERSION == 3))
        tmp_ctl = _CLR_SET_FLD32U(tmp_ctl, SMIF_CTL_DELAY_TAP_ENABLED, config->delayTapEnable);
        tmp_ctl = _CLR_SET_FLD32U(tmp_ctl, SMIF_CTL_DELAY_LINE_SEL, config->delayLineSelect);
#endif

#if (CY_IP_MXSMIF_VERSION >= 4)
        /* Enable the DLL, if enabled and input frequency is above minimum threshold.
           Otherwise, enable the bypass for SMIFv5 or greater. */
        result = Cy_SMIF_DllConfig(base, config, context);
        if (result != CY_SMIF_SUCCESS)
        {
            CY_ASSERT(false);
            return result;
        }

        /* Set the MDL taps for SMIF, and SDL taps for device0 and device1. */
        result = Cy_SMIF_Set_DelayTapSel(base, (uint8_t)config->mdl_tap);
#if (SMIF_DEVICE_NR >= 1)
        if (result == CY_SMIF_SUCCESS)
        {
            result = Cy_SMIF_Set_Sdl_DelayTapSel(&(base->DEVICE[0]), (uint8_t)config->device0_sdl_tap);
        }
#endif
#if (SMIF_DEVICE_NR >= 2)
        if (result == CY_SMIF_SUCCESS)
        {
            result = Cy_SMIF_Set_Sdl_DelayTapSel(&(base->DEVICE[1]), (uint8_t)config->device1_sdl_tap);
        }
#endif
#if (SMIF_DEVICE_NR >= 3)
        if (result == CY_SMIF_SUCCESS)
        {
            result = Cy_SMIF_Set_Sdl_DelayTapSel(&(base->DEVICE[2]), (uint8_t)config->device2_sdl_tap);
        }
#endif
#if (SMIF_DEVICE_NR >= 4)
        if (result == CY_SMIF_SUCCESS)
        {
            result = Cy_SMIF_Set_Sdl_DelayTapSel(&(base->DEVICE[3]), (uint8_t)config->device3_sdl_tap);
        }
#endif

        /* In case user is working with higher frequencies increase initial set up and hold delay */
        tmp_ctl &= ~(SMIF_CORE_CTL_SELECT_SETUP_DELAY_Msk | SMIF_CORE_CTL_SELECT_HOLD_DELAY_Msk);
        if (config->inputFrequencyMHz >= 300U)
        {
            tmp_ctl |= _VAL2FLD(SMIF_CORE_CTL_SELECT_SETUP_DELAY, 2);
            tmp_ctl |= _VAL2FLD(SMIF_CORE_CTL_SELECT_HOLD_DELAY, 2);
        }
        else
        {
            tmp_ctl |= _VAL2FLD(SMIF_CORE_CTL_SELECT_SETUP_DELAY, 1);
            tmp_ctl |= _VAL2FLD(SMIF_CORE_CTL_SELECT_HOLD_DELAY, 1);
        }
#endif /* (CY_IP_MXSMIF_VERSION >= 4) */

        SMIF_CTL(base) = tmp_ctl;
    }

    return result;
}

