PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_smif.c
/*******************************************************************************
* Function Name: Cy_SMIF_SetMode
****************************************************************************//**
*
* Sets the mode of operation for the SMIF. The mode of operation can be the XIP
* mode where the slave devices are mapped as memories and are directly accessed
* from the PSoC register map. In the MMIO mode, the SMIF block acts as a simple
* SPI engine. MMIO mode and XIP modes are mutually exclusive. SMIF IP Version 3
* and above support MMIO mode transactions even when XIP mode is enabled. However,
* user has to ensure that XIP transaction is not issued during an ongoing MMIO
* transaction. Rather wait for MMIO transaction to complete since few MMIO operations
* make external flash busy and it cannot respond to XIP read transaction.
*
* \note With SMIF V1 IP, Interrupt and triggers are not working in XIP mode, see TRM for details
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param mode
* The mode of the SMIF operation.
*
*******************************************************************************/
void Cy_SMIF_SetMode(SMIF_Type *base, cy_en_smif_mode_t mode)
{
    CY_ASSERT_L3(CY_SMIF_MODE_VALID(mode));

    /*  Set the register SMIF.CTL.XIP_MODE = TRUE */
    if (CY_SMIF_NORMAL == mode)
    {
        SMIF_CTL(base) &= ~ SMIF_CTL_XIP_MODE_Msk;
    }
    else
    {
#if ((CY_IP_MXSMIF_VERSION==2UL) || (CY_IP_MXSMIF_VERSION==3UL))
        uint32_t read_cmd_data_ctl;
        uint8_t idx;

        /* Context variable is not available in this API. To make the API backward compatible
         * we search if any of the device uses XIP and pick the data rate from that device.
         * Multiple devices supporting XIP mode is not supported with the version of driver.
         */

        for (idx = 0U; idx < SMIF_DEVICE_NR; idx++)
        {
            read_cmd_data_ctl = SMIF_DEVICE_IDX_RD_DATA_CTL(base, idx);

            if ((read_cmd_data_ctl & SMIF_DEVICE_RD_DATA_CTL_DDR_MODE_Msk) != 0UL)
            {
                uint32_t temp;
                /* Select TX Clock mode SDR/DDR */
                temp = SMIF_CTL(base);
                temp &= ~(SMIF_CTL_CLOCK_IF_TX_SEL_Msk);
                SMIF_CTL(base) =  temp | _VAL2FLD(SMIF_CTL_CLOCK_IF_TX_SEL, CY_SMIF_DDR);
                break;
            }
        }
#endif /* CY_IP_MXSMIF_VERSION */
        SMIF_CTL(base) |= SMIF_CTL_XIP_MODE_Msk;
    }
}


/*******************************************************************************
* Function Name: Cy_SMIF_GetMode
****************************************************************************//**
*
* Reads the mode of operation for the SMIF. The mode of operation can be the
* XIP mode where the slave devices are mapped as memories and are directly
* accessed from the PSoC register map. In the MMIO mode, the SMIF block acts as
* a simple SPI engine.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \return The mode of SMIF operation (see \ref cy_en_smif_mode_t).
*
*******************************************************************************/
cy_en_smif_mode_t Cy_SMIF_GetMode(SMIF_Type const *base)
{
    cy_en_smif_mode_t result = CY_SMIF_NORMAL;

    /* Read the register SMIF.CTL.XIP_MODE */
    if (0U != (SMIF_CTL(base) & SMIF_CTL_XIP_MODE_Msk))
    {
        result = CY_SMIF_MEMORY;
    }

    return (result);
}


/*******************************************************************************
* Function Name: Cy_SMIF_SetDataSelect
****************************************************************************//**
*
* This function configures the data select option for a specific slave. The
* selection provides pre-set combinations for connecting the SMIF data lines to
* the GPIOs.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param slaveSelect
* The slave device ID. This number is either CY_SMIF_SLAVE_SELECT_0 or
* CY_SMIF_SLAVE_SELECT_1 or CY_SMIF_SLAVE_SELECT_2 or CY_SMIF_SLAVE_SELECT_3
* (\ref cy_en_smif_slave_select_t). It defines the slave select line to be used
* during the transmission.
*
* \param dataSelect
* This parameter selects the data select option. \ref cy_en_smif_data_select_t
*
*******************************************************************************/
void Cy_SMIF_SetDataSelect(SMIF_Type *base, cy_en_smif_slave_select_t slaveSelect,
                           cy_en_smif_data_select_t dataSelect)
{
    SMIF_DEVICE_Type volatile *device;

    CY_ASSERT_L3(CY_SMIF_SLAVE_SEL_VALID(slaveSelect));
    CY_ASSERT_L3(CY_SMIF_DATA_SEL_VALID(dataSelect));

    /* Connect the slave to its data lines */
    device = Cy_SMIF_GetDeviceBySlot(base, slaveSelect);

    if (NULL != device)
    {
        SMIF_DEVICE_CTL(device) = _CLR_SET_FLD32U(SMIF_DEVICE_CTL(device),
                                  SMIF_DEVICE_CTL_DATA_SEL,
                                  (uint32_t)dataSelect);
    }
}

#if defined (CY_IP_MXSMIF_VERSION) && (CY_IP_MXSMIF_VERSION >= 4) || defined (CY_DOXYGEN)
/*******************************************************************************
* Function Name: Cy_SMIF_Set_Sdl_DelayTapSel
****************************************************************************//**
*
* This function sets the SDL (slave clock) delay tap number for the SMIF (common
* for all its devices).  It sets both the positive and negative taps to the same
* value.
*
* \param smif_device_base
* Holds the base address of the SMIF_DEVICE block registers.
*
* \param tapSel
* positive and negative delay tap selection to be set
*
* \return status (see \ref cy_en_smif_status_t).
*
*******************************************************************************/
cy_en_smif_status_t Cy_SMIF_Set_Sdl_DelayTapSel(SMIF_CORE_DEVICE_Type *smif_device_base, uint8_t tapSel)
{
    /* Check for valid device address input parameter. */
#if defined (CY_IP_MXSMIF_VERSION) && (CY_IP_MXSMIF_VERSION >= 4u)
#if (SMIF_DEVICE_NR == 2u)
    if ((smif_device_base != SMIF0_CORE0_DEVICE0) && (smif_device_base != SMIF0_CORE0_DEVICE1) &&
            (smif_device_base != SMIF0_CORE1_DEVICE0) && (smif_device_base != SMIF0_CORE1_DEVICE1))
#elif (SMIF_DEVICE_NR == 4u) && (CY_IP_MXSMIF_VERSION == 6u)
    if ((smif_device_base != SMIF0_CORE_DEVICE0) && (smif_device_base != SMIF0_CORE_DEVICE1) &&
            (smif_device_base != SMIF0_CORE_DEVICE2) && (smif_device_base != SMIF0_CORE_DEVICE3) &&
            (smif_device_base != SMIF1_CORE_DEVICE0) && (smif_device_base != SMIF1_CORE_DEVICE1) &&
            (smif_device_base != SMIF1_CORE_DEVICE2) && (smif_device_base != SMIF1_CORE_DEVICE3))
#else
    if ((smif_device_base != SMIF0_CORE0_DEVICE0) && (smif_device_base != SMIF0_CORE0_DEVICE1) &&
            (smif_device_base != SMIF0_CORE0_DEVICE2) && (smif_device_base != SMIF0_CORE0_DEVICE3) &&
            (smif_device_base != SMIF0_CORE1_DEVICE0) && (smif_device_base != SMIF0_CORE1_DEVICE1) &&
            (smif_device_base != SMIF0_CORE1_DEVICE2) && (smif_device_base != SMIF0_CORE1_DEVICE3))
#endif
#else
#if (SMIF_DEVICE_NR == 2u)
    if ((smif_device_base != SMIF0_DEVICE0) && (smif_device_base != SMIF0_DEVICE1))
#elif (SMIF_DEVICE_NR == 3u)
    if ((smif_device_base != SMIF0_DEVICE0) && (smif_device_base != SMIF0_DEVICE1) &&
            (smif_device_base != SMIF0_DEVICE2))
#elif (SMIF_DEVICE_NR == 4u)
    if ((smif_device_base != SMIF0_DEVICE0) && (smif_device_base != SMIF0_DEVICE1) &&
            (smif_device_base != SMIF0_DEVICE2) && (smif_device_base != SMIF0_DEVICE3))
#endif
#endif
    {
        return CY_SMIF_BAD_PARAM;
    }

    /* Check the the delay tap is within range. */
    if (tapSel > (CY_SMIF_GetDelayTapsNumber(smif_device_base) - 1UL))
    {
        return CY_SMIF_BAD_PARAM;
    }

