PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_smif.c
            result = CY_SMIF_SUCCESS;
        }
    }

    return (result);
}
/*******************************************************************************
* Function Name: Cy_SMIF_SendDummyCycles_With_RWDS()
****************************************************************************//**
*
* This function sends dummy-clock cycles and observes additional input data signal RWDS.
* The data lines are tri-stated during
* the dummy cycles.
*
* \note This function is to be preceded by \ref Cy_SMIF_TransmitCommand_Ext.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param read_rwds
* Indicates whether it is read/write transaction. "true" in case of read. "false" in case of write.
*
* \param refresh_indicator
* Dummy cycles are doubled when RWDS refresh indicator is high during CA cycle. (HyperRAM variable latency mode)
*
* \param cycles
* The number of dummy cycles. Must be > 0 and not greater than 65536.
*
* \return A status of dummy cycles sending.
*       - \ref CY_SMIF_SUCCESS
*       - \ref CY_SMIF_CMD_FIFO_FULL
*       - \ref CY_SMIF_BAD_PARAM
*
*******************************************************************************/
cy_en_smif_status_t Cy_SMIF_SendDummyCycles_With_RWDS(SMIF_Type *base,
        bool read_rwds,
        bool refresh_indicator,
        uint32_t cycles)
{
    /* The return variable */
    cy_en_smif_status_t result = CY_SMIF_BAD_PARAM;

    if (cycles > 0U)
    {
        result = CY_SMIF_CMD_FIFO_FULL;

        /* Check if there are enough free entries in TX_CMD_FIFO */
        if (Cy_SMIF_GetCmdFifoStatus(base) < CY_SMIF_TX_CMD_FIFO_STATUS_RANGE)
        {
            /* Send the dummy bytes */
            SMIF_TX_CMD_MMIO_FIFO_WR(base) =
                _VAL2FLD(CY_SMIF_CMD_MMIO_FIFO_WR_MODE, CY_SMIF_CMD_FIFO_DUMMY_COUNT_MODE) |
                _VAL2FLD(CY_SMIF_CMD_MMIO_FIFO_WR_DUMMY, (cycles - 1UL)) |
                _VAL2FLD(CY_SMIF_CMD_MMIO_FIFO_WR_WIDTH, (uint32_t)CY_SMIF_WIDTH_OCTAL)    |
                _VAL2FLD(CY_SMIF_CMD_MMIO_FIFO_WR_DATA_RATE, (uint32_t) CY_SMIF_DDR) |
                _VAL2FLD(CY_SMIF_CMD_MMIO_FIFO_WR_DUMMY_READ_RWDS, (uint32_t)read_rwds) |
                _VAL2FLD(CY_SMIF_CMD_MMIO_FIFO_WR_DUMMY_WRITE_RWDS, (uint32_t)!(read_rwds)) |
                _VAL2FLD(CY_SMIF_CMD_MMIO_FIFO_WR_RWDS_REFRESH, (uint32_t)refresh_indicator) |
                _VAL2FLD(CY_SMIF_CMD_MMIO_FIFO_WR_LAST_BYTE, 0);

            result = CY_SMIF_SUCCESS;
        }
    }

    return (result);
}
#endif /* CY_IP_MXSMIF_VERSION */


/*******************************************************************************
* Function Name: Cy_SMIF_SetCryptoKey
****************************************************************************//**
*
* Sets the AES-128 encryption key into SMIF crypto registers.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param key
* An array containing 128 bit crypto key: uint32_t key[4].
* The least significant word first.
*
*******************************************************************************/
void Cy_SMIF_SetCryptoKey(SMIF_Type *base, uint32_t *key)
{
    SMIF_CRYPTO_KEY0(base) = key[0U];
    SMIF_CRYPTO_KEY1(base) = key[1U];
    SMIF_CRYPTO_KEY2(base) = key[2U];
    SMIF_CRYPTO_KEY3(base) = key[3U];
}

/*******************************************************************************
* Function Name: Cy_SMIF_SetCryptoIV
****************************************************************************//**
*
* Sets the 96 bit initialization vector (nonce) into SMIF crypto registers.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param nonce
* An array containing 96 bit initialization vector (nonce)
*
*******************************************************************************/
void Cy_SMIF_SetCryptoIV(SMIF_Type *base, uint32_t *nonce)
{
    /* SMIF_CRYPTO_INPUT0 is a counter, the rest 3 registers are nonce */
    SMIF_CRYPTO_INPUT1(base) = nonce[0U];
    SMIF_CRYPTO_INPUT2(base) = nonce[1U];
    SMIF_CRYPTO_INPUT3(base) = nonce[2U];
}

/*******************************************************************************
* Function Name: Cy_SMIF_ConvertSlaveSlotToIndex
****************************************************************************//**
*
* Converts Slave Select enum to the device index.
*
* \param ss
* Slave Select enum.
*
* \param device_idx
* A pointer to device index to be returned.
*
* \return \ref cy_en_smif_status_t.
*
*******************************************************************************/
cy_en_smif_status_t Cy_SMIF_ConvertSlaveSlotToIndex(cy_en_smif_slave_select_t ss, uint32_t *device_idx)
{
    cy_en_smif_status_t ret = CY_SMIF_BAD_PARAM;

    switch (ss)
    {
    case CY_SMIF_SLAVE_SELECT_0:
        *device_idx = 0U;
        ret = CY_SMIF_SUCCESS;
        break;
    case CY_SMIF_SLAVE_SELECT_1:
        *device_idx = 1U;
        ret = CY_SMIF_SUCCESS;
        break;
    case CY_SMIF_SLAVE_SELECT_2:
        *device_idx = 2U;
        ret = CY_SMIF_SUCCESS;
        break;
    case CY_SMIF_SLAVE_SELECT_3:
        *device_idx = 3U;
        ret = CY_SMIF_SUCCESS;
        break;
    default:
        /* The switch statement must have a non-empty default clause. MISRA 16.4 */
        ret = CY_SMIF_BAD_PARAM;
        break;
    }
    return ret;
}

/*******************************************************************************
* Function Name: Cy_SMIF_SetCryptoEnable
****************************************************************************//**
*
* Enables SMIF encryption
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param slaveId
* salve select line to indicate the device on which encryption should be enabled.
*
* \return \ref cy_en_smif_status_t.
*
* \note Please ensure cache is disabled using \ref Cy_SMIF_CacheDisable or
* invalidated using \ref Cy_SMIF_CacheInvalidate or any other system level cache to
* be cleared so that the next read/execute from flash operation results in correct data.
*
*******************************************************************************/
cy_en_smif_status_t Cy_SMIF_SetCryptoEnable(SMIF_Type *base, cy_en_smif_slave_select_t slaveId)
{
    uint32_t device_idx;
    cy_en_smif_status_t ret = CY_SMIF_BAD_PARAM;

    if (CY_SMIF_SUCCESS == Cy_SMIF_ConvertSlaveSlotToIndex(slaveId, &device_idx))
    {
        SMIF_DEVICE_IDX_CTL(base, device_idx) |= SMIF_DEVICE_CTL_CRYPTO_EN_Msk;
        ret = CY_SMIF_SUCCESS;
    }

    return ret;
}


