PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_smif.c
/*******************************************************************************
* Function Name: Cy_SMIF_CacheInvalidate
****************************************************************************//**
*
* This function is used to invalidate/clear the fast cache, the slow cache or
* both
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param cacheType
* Holds the type of the cache to be modified. \ref cy_en_smif_cache_t
*
* \return A status of function completion.
*       - \ref CY_SMIF_SUCCESS
*       - \ref CY_SMIF_BAD_PARAM
*
*******************************************************************************/
cy_en_smif_status_t Cy_SMIF_CacheInvalidate(SMIF_Type *base,
        cy_en_smif_cache_t cacheType)
{
    cy_en_smif_status_t status = CY_SMIF_SUCCESS;
    switch (cacheType)
    {
    case CY_SMIF_CACHE_SLOW:
        SMIF_SLOW_CA_CMD(base) |= SMIF_SLOW_CA_CMD_INV_Msk;
        break;
    case CY_SMIF_CACHE_FAST:
        SMIF_FAST_CA_CMD(base) |= SMIF_FAST_CA_CMD_INV_Msk;
        break;
    case CY_SMIF_CACHE_BOTH:
        SMIF_SLOW_CA_CMD(base) |= SMIF_SLOW_CA_CMD_INV_Msk;
        SMIF_FAST_CA_CMD(base) |= SMIF_FAST_CA_CMD_INV_Msk;
        break;
    default:
        /* A user error */
        status = CY_SMIF_BAD_PARAM;
        break;
    }
    return (status);
}

#if ((CY_IP_MXSMIF_VERSION >= 4) && (defined (SMIF_BRIDGE_PRESENT) && (SMIF_BRIDGE_PRESENT == 1u))) || defined (CY_DOXYGEN)
/*******************************************************************************
 * Function Name: Cy_SMIF_IsBridgeOn
 ****************************************************************************//**
* This function is used to check the bridge enable state.
*
* \param base
* Holds the base address of the SMIF base registers.
*
* \return True if the bridge is active (enabled), false if the bridge is not enabled.
*
*******************************************************************************/
bool Cy_SMIF_IsBridgeOn(SMIF_Base_Type *base)
{
    CY_ASSERT_L1(NULL != base);

    return (_FLD2VAL(SMIF_SMIF_BRIDGE_CTL_ENABLED, SMIF_BRIDGE_CTL(base)) != 0UL);
}

/*******************************************************************************
 * Function Name: Cy_SMIF_Bridge_Enable
 ****************************************************************************//**
* This function is used to enable/disable Bridge
*
* \param base
* Holds the base address of the SMIF base registers.
*
* \param enable
* enable/disable the bridge
*
*******************************************************************************/
cy_en_smif_status_t Cy_SMIF_Bridge_Enable(SMIF_Base_Type *base, bool enable)
{
    CY_ASSERT_L1(NULL != base);

    uint32_t prevStatus = Cy_SysLib_EnterCriticalSection();

    /* Confirming all smif core is not busy */
    for (uint32_t smifCoreIdx = 0; smifCoreIdx < CY_SMIF_CORE_COUNT; smifCoreIdx += 1U)
    {
        if (Cy_SMIF_BusyCheck(&(base->CORE[smifCoreIdx])) == true)
        {
            CY_ASSERT_L1(false);
            return CY_SMIF_BUSY;
        }
    }

    /* Set Enable bit of the smif bridge */
    SMIF_BRIDGE_CTL(base) = (enable ?
                             (SMIF_BRIDGE_CTL(base) | (SMIF_SMIF_BRIDGE_CTL_ENABLED_Msk)) :
                             (SMIF_BRIDGE_CTL(base) & ~(SMIF_SMIF_BRIDGE_CTL_ENABLED_Msk)));

    Cy_SysLib_ExitCriticalSection(prevStatus);

    return CY_SMIF_SUCCESS;
}
#endif /* ((CY_IP_MXSMIF_VERSION >= 4) && (defined (SMIF_BRIDGE_PRESENT) && (SMIF_BRIDGE_PRESENT == 1u))) || defined (CY_DOXYGEN) */

#if (CY_IP_MXSMIF_VERSION>=4) || defined (CY_DOXYGEN)
/*******************************************************************************
* Function Name: Cy_SMIF_SetRxCaptureMode
****************************************************************************//**
* This function sets the Rx Capture mode setting for SMIF IP block instance
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param mode
* Rx Capture mode \ref cy_en_smif_capture_mode_t
*
* \param slaveId
* Slave ID for which RX Capture configuration has to be updated.
*
* \snippet smif/snippet/main.c snippet_SMIF_DLP
*
*******************************************************************************/
cy_en_smif_status_t Cy_SMIF_SetRxCaptureMode(SMIF_Type *base, cy_en_smif_capture_mode_t mode, cy_en_smif_slave_select_t slaveId)
{
    CY_ASSERT_L1(NULL != base);
    uint32_t device_idx;

    /* RX CAPTURE MODE cannot be changed when IP is in enabled state */
    if ((SMIF_CTL(base) & SMIF_CTL_ENABLED_Msk) != 0U)
    {
        return CY_SMIF_BAD_PARAM;
    }
    else
    {
        SMIF_CTL2(base) &= ~SMIF_CORE_CTL2_RX_CAPTURE_MODE_Msk;
        SMIF_CTL2(base) |= _VAL2FLD(SMIF_CORE_CTL2_RX_CAPTURE_MODE, (uint32_t)mode);

        /* For RX Capture MODE 2, DDR_PIPELINE_POS_DAT must be set to 1 */
        if (CY_SMIF_SUCCESS == Cy_SMIF_ConvertSlaveSlotToIndex(slaveId, &device_idx))
        {
            SMIF_DEVICE_IDX_RX_CAPTURE_CONFIG(base, device_idx) |= SMIF_CORE_DEVICE_RX_CAPTURE_CONFIG_DDR_PIPELINE_POS_DAT_Msk;
        }

        return CY_SMIF_SUCCESS;
    }
}
#endif  /*  (CY_IP_MXSMIF_VERSION>=4) || defined (CY_DOXYGEN) */

#if ((CY_IP_MXSMIF_VERSION>=4) && \
     ((defined (SMIF_DLP_PRESENT) && (SMIF_DLP_PRESENT > 0)) || \
      (defined (SMIF0_DLP_PRESENT) && (SMIF0_DLP_PRESENT > 0)) || \
      (defined (SMIF1_DLP_PRESENT) && (SMIF1_DLP_PRESENT > 0))) || defined (CY_DOXYGEN))
/*******************************************************************************
* Function Name: Cy_SMIF_SetMasterDLP
****************************************************************************//**
* This function sets the data learning pattern
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param dlp
* data learning pattern (maximum 16-bit)
*
* \param size
* pattern size (allowed range 1 to 16 bits)
*
* \return status of configuration.
*       - \ref CY_SMIF_SUCCESS
*       - \ref CY_SMIF_BAD_PARAM
*
* \snippet smif/snippet/main.c snippet_SMIF_DLP
*
*******************************************************************************/
cy_en_smif_status_t Cy_SMIF_SetMasterDLP(SMIF_Type *base, uint16 dlp, uint8_t size)
{
    cy_en_smif_status_t status = CY_SMIF_SUCCESS;

    CY_ASSERT_L1(NULL != base);

