PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_smif.c
    if ((size == 0U) || (size > 16U))
    {
        status = CY_SMIF_BAD_PARAM;
    }

    if (status == CY_SMIF_SUCCESS)
    {
        /* Clear values before writing user provided inputs */
        SMIF_DLP_CTL(base) = (_VAL2FLD(SMIF_CORE_DLP_CTL_DLP, 0) |
                              _VAL2FLD(SMIF_CORE_DLP_CTL_DLP_SIZE, 0));

        /* Configure user inputs */
        SMIF_DLP_CTL(base) = (_VAL2FLD(SMIF_CORE_DLP_CTL_DLP, dlp) |
                              _VAL2FLD(SMIF_CORE_DLP_CTL_DLP_SIZE, (uint32_t)size - 1UL));
    }
    return status;
}
/*******************************************************************************
* Function Name: Cy_SMIF_GetMasterDLP
****************************************************************************//**
* This function gets the data learning pattern configured.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \return Data learning pattern configured
*
*
* \snippet smif/snippet/main.c snippet_SMIF_DLP
*
*******************************************************************************/
uint16_t Cy_SMIF_GetMasterDLP(SMIF_Type *base)
{
    return (uint16_t)_FLD2VAL(SMIF_CORE_DLP_CTL_DLP, SMIF_DLP_CTL(base));
}
/*******************************************************************************
* Function Name: Cy_SMIF_GetMasterDLPSize
****************************************************************************//**
* This function gets the data learning pattern size configured.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \return Data learning pattern size configured.
*
* \snippet smif/snippet/main.c snippet_SMIF_DLP
*
*******************************************************************************/
uint8_t Cy_SMIF_GetMasterDLPSize(SMIF_Type *base)
{
    return (uint8_t)(_FLD2VAL(SMIF_CORE_DLP_CTL_DLP_SIZE, SMIF_DLP_CTL(base)) + 1U);
}
/*******************************************************************************
* Function Name: Cy_SMIF_GetTapNumCapturedCorrectDLP
****************************************************************************//**
* This function gets number of delay taps used for specified data line.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param bit
* DLP Tap selection for the bit position mapped as per \ref Cy_SMIF_SetDataSelect.
*
* \return Data learning pattern configured
*
* \snippet smif/snippet/main.c snippet_Cy_SMIF_GetTapNumCapturedCorrectDLP
*
*******************************************************************************/
uint8_t Cy_SMIF_GetTapNumCapturedCorrectDLP(SMIF_Type *base, uint8_t bit)
{
    uint32_t delay_tap = 0;

    switch (bit)
    {
    case 0:
    {
        delay_tap = _FLD2VAL(SMIF_CORE_DLP_DELAY_TAP_SEL0_DATA_BIT0_TAP_SEL, SMIF_DLP_DELAY_TAP_SEL0(base));
    }
    break;
    case 1:
    {
        delay_tap = _FLD2VAL(SMIF_CORE_DLP_DELAY_TAP_SEL0_DATA_BIT1_TAP_SEL, SMIF_DLP_DELAY_TAP_SEL0(base));
    }
    break;
    case 2:
    {
        delay_tap = _FLD2VAL(SMIF_CORE_DLP_DELAY_TAP_SEL0_DATA_BIT2_TAP_SEL, SMIF_DLP_DELAY_TAP_SEL0(base));
    }
    break;
    case 3:
    {
        delay_tap = _FLD2VAL(SMIF_CORE_DLP_DELAY_TAP_SEL0_DATA_BIT3_TAP_SEL, SMIF_DLP_DELAY_TAP_SEL0(base));
    }
    break;
    case 4:
    {
        delay_tap = _FLD2VAL(SMIF_CORE_DLP_DELAY_TAP_SEL1_DATA_BIT4_TAP_SEL, SMIF_DLP_DELAY_TAP_SEL1(base));
    }
    break;
    case 5:
    {
        delay_tap = _FLD2VAL(SMIF_CORE_DLP_DELAY_TAP_SEL1_DATA_BIT5_TAP_SEL, SMIF_DLP_DELAY_TAP_SEL1(base));
    }
    break;
    case 6:
    {
        delay_tap = _FLD2VAL(SMIF_CORE_DLP_DELAY_TAP_SEL1_DATA_BIT6_TAP_SEL, SMIF_DLP_DELAY_TAP_SEL1(base));
    }
    break;
    case 7:
    {
        delay_tap = _FLD2VAL(SMIF_CORE_DLP_DELAY_TAP_SEL1_DATA_BIT7_TAP_SEL, SMIF_DLP_DELAY_TAP_SEL1(base));
    }
    break;
    default:
        delay_tap = 0;
        break;
    }
    return (uint8_t)delay_tap;
}
#endif  /* (CY_IP_MXSMIF_VERSION>=4) &&
     ((defined (SMIF_DLP_PRESENT) && (SMIF_DLP_PRESENT > 0)) ||
      (defined (SMIF0_DLP_PRESENT) && (SMIF0_DLP_PRESENT > 0)) ||
      (defined (SMIF1_DLP_PRESENT) && (SMIF1_DLP_PRESENT > 0))) || defined (CY_DOXYGEN)) */

#if (CY_IP_MXSMIF_VERSION>=2) || defined (CY_DOXYGEN)
/*******************************************************************************
* Function Name: Cy_SMIF_DeviceTransfer_SetMergeTimeout
****************************************************************************//**
*
* This function enables merging continuous transfers over XIP so that the overhead
* of transferring command and address will not be there for reading consecutive addresses.
* User can specify a timeout value to specify how long the device would be selected waiting
* for next incremental address read.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param slave
* Holds the slave select line for which merge should be enabled.
*
* \param timeout (see \ref cy_en_smif_merge_timeout_t)
*
* \note External memory should also support this mode of transfer.
*
* \snippet smif/snippet/main.c snippet_Cy_SMIF_MergeTimeout
*******************************************************************************/
void Cy_SMIF_DeviceTransfer_SetMergeTimeout(SMIF_Type *base, cy_en_smif_slave_select_t slave, cy_en_smif_merge_timeout_t timeout)
{
    SMIF_DEVICE_Type volatile * device = Cy_SMIF_GetDeviceBySlot(base, slave);
    uint32_t temp;
    temp = SMIF_DEVICE_CTL(device);
    temp &= ~(SMIF_DEVICE_CTL_MERGE_TIMEOUT_Msk);
    SMIF_DEVICE_CTL(device) = temp | _VAL2FLD(SMIF_DEVICE_CTL_MERGE_EN,  1U)  |
                              _VAL2FLD(SMIF_DEVICE_CTL_MERGE_TIMEOUT, (uint32_t)timeout);
}

/*******************************************************************************
* Function Name: Cy_SMIF_DeviceTransfer_ClearMergeTimeout
****************************************************************************//**
*
* This function disables continuous transfer merging.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param slave
* Holds the slave select line for which merge should be disabled.
*
* \note External memory should also support this mode of transfer.
*
* \snippet smif/snippet/main.c snippet_Cy_SMIF_MergeTimeout
*******************************************************************************/
void Cy_SMIF_DeviceTransfer_ClearMergeTimeout(SMIF_Type *base, cy_en_smif_slave_select_t slave)
{
    SMIF_DEVICE_Type volatile * device = Cy_SMIF_GetDeviceBySlot(base, slave);
    uint32_t temp;
    temp = SMIF_DEVICE_CTL(device);
    temp &= ~(SMIF_DEVICE_CTL_MERGE_EN_Msk | SMIF_DEVICE_CTL_MERGE_TIMEOUT_Msk);
    SMIF_DEVICE_CTL(device) = temp;
}
#endif /* (CY_IP_MXSMIF_VERSION>=2) || defined (CY_DOXYGEN) */

#if defined (CY_IP_MXS40SRSS) || defined (CY_IP_MXS40SSRSS) || defined (CY_IP_MXS22SRSS)
/*******************************************************************************
* Function Name: Cy_SMIF_DeepSleepCallback
****************************************************************************//**
*
* This function handles the transition of the SMIF into and out of Deep
* Sleep mode. It prevents the device from entering DeepSleep if SMIF is actively
* communicating, or there is any data in the TX or RX FIFOs, or SMIF is in
* memory mode.
*
* This function should be called while execution of \ref Cy_SysPm_CpuEnterDeepSleep
* therefore must be registered as a callback before the call. To register it
* call \ref Cy_SysPm_RegisterCallback and specify \ref CY_SYSPM_DEEPSLEEP
* as the callback type.
*
* \note
* This API is template and user should add code for external memory enter/exit
* low power mode.
*
* \param callbackParams
* The pointer to the structure with SMIF SysPm callback parameters (pointer to
* SMIF registers, context and call mode \ref cy_stc_syspm_callback_params_t).
*
* \param mode
* Callback mode, see \ref cy_en_syspm_callback_mode_t
*
* \return
* \ref cy_en_syspm_status_t
*
* Example setup of SysPM deep sleep and hibernate mode
* \snippet smif/snippet/main.c SMIF SysPM Callback
*
*******************************************************************************/
cy_en_syspm_status_t Cy_SMIF_DeepSleepCallback(cy_stc_syspm_callback_params_t *callbackParams, cy_en_syspm_callback_mode_t mode)
{
    cy_en_syspm_status_t retStatus = CY_SYSPM_SUCCESS;

    CY_ASSERT_L1(NULL != callbackParams);

    SMIF_Type *locBase = (SMIF_Type *) callbackParams->base;
    cy_stc_smif_context_t *locContext = (cy_stc_smif_context_t *) callbackParams->context;

    switch (mode)
    {
    case CY_SYSPM_CHECK_READY:
    {
        /* Check if API is not busy executing transfer operation */
        /* If SPI bus is not busy, all data elements are transferred on
            * the bus from the TX FIFO and shifter and the RX FIFIOs is
            * empty - the SPI is ready enter Deep Sleep.
        */
        bool checkFail = (CY_SMIF_RX_BUSY == (cy_en_smif_txfr_status_t)
                          Cy_SMIF_GetTransferStatus(locBase, locContext));
        checkFail = (Cy_SMIF_BusyCheck(locBase)) || checkFail;
        checkFail = (Cy_SMIF_GetMode(locBase) == CY_SMIF_MEMORY) || checkFail;

        if (checkFail)
        {
            retStatus = CY_SYSPM_FAIL;
        }
        else
        {
#if (CY_IP_MXSMIF_VERSION == 5u) || (CY_IP_MXSMIF_VERSION == 4u)
            if ((SMIF_CORE_Type *)locBase == (SMIF_CORE_Type *)SMIF0_CORE0)
            {
                (void)Cy_SysClk_ClkHfDisable(CY_SMIF_CORE_0_HF);
            }
            if ((SMIF_CORE_Type *)locBase == (SMIF_CORE_Type *)SMIF0_CORE1)
            {
                (void)Cy_SysClk_ClkHfDisable(CY_SMIF_CORE_1_HF);
            }
#endif
            Cy_SMIF_Disable(locBase);
            retStatus = CY_SYSPM_SUCCESS;
        }
        /* Add check memory that memory not in progress */
    }
    break;

    case CY_SYSPM_CHECK_FAIL:
    {
        /* Other driver is not ready for Deep Sleep. Restore Active mode
        * configuration.
        */
#if (CY_IP_MXSMIF_VERSION == 5u) || (CY_IP_MXSMIF_VERSION == 4u)
        if ((SMIF_CORE_Type *)locBase == (SMIF_CORE_Type *)SMIF0_CORE0)
        {
            (void)Cy_SysClk_ClkHfEnable(CY_SMIF_CORE_0_HF);
        }
        if ((SMIF_CORE_Type *)locBase == (SMIF_CORE_Type *)SMIF0_CORE1)
        {
            (void)Cy_SysClk_ClkHfEnable(CY_SMIF_CORE_1_HF);
        }
#endif
        Cy_SMIF_Enable(locBase, locContext);

