PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_smif.c
    }
    break;

    case CY_SYSPM_BEFORE_TRANSITION:
    {
        /* This code executes inside critical section and enabling active
        * interrupt source makes interrupt pending in the NVIC. However
        * interrupt processing is delayed until code exists critical
        * section. The pending interrupt force WFI instruction does
        * nothing and device remains in the active mode.
        */

        /* Put external memory in low power mode */
    }
    break;

    case CY_SYSPM_AFTER_TRANSITION:
    {
#if (CY_IP_MXSMIF_VERSION == 5u) || (CY_IP_MXSMIF_VERSION == 4u)
        if ((SMIF_CORE_Type *)locBase == (SMIF_CORE_Type *)SMIF0_CORE0)
        {
            (void)Cy_SysClk_ClkHfEnable(CY_SMIF_CORE_0_HF);
        }
        if ((SMIF_CORE_Type *)locBase == (SMIF_CORE_Type *)SMIF0_CORE1)
        {
            (void)Cy_SysClk_ClkHfEnable(CY_SMIF_CORE_1_HF);
        }
#endif
        /* Put external memory in active mode */
        Cy_SMIF_Enable(locBase, locContext);
    }
    break;

    default:
        retStatus = CY_SYSPM_FAIL;
        break;
    }

    return (retStatus);
}


/*******************************************************************************
* Function Name: Cy_SMIF_HibernateCallback
****************************************************************************//**
*
* This function handles the transition of the SMIF into Hibernate mode.
* It prevents the device from entering Hibernate if the SMIF
* is actively communicating, or there is any data in the TX or RX FIFO, or SMIF
* is in memory mode.
*
* This function should be called during execution of \ref Cy_SysPm_SystemEnterHibernate
* therefore it must be registered as a callback before the call. To register it
* call \ref Cy_SysPm_RegisterCallback and specify \ref CY_SYSPM_HIBERNATE
* as the callback type.
*
* \note
* This API is template and user should add code for external memory enter/exit
* low power mode.
*
* \param callbackParams
* The pointer to the structure with SMIF SysPm callback parameters (pointer to
* SMIF registers, context and call mode \ref cy_stc_syspm_callback_params_t).
*
* \param mode
* Callback mode, see \ref cy_en_syspm_callback_mode_t
*
* \return
* \ref cy_en_syspm_status_t
*
* Example setup of SysPM deep sleep and hibernate mode
* \snippet smif/snippet/main.c SMIF SysPM Callback
*
*******************************************************************************/
cy_en_syspm_status_t Cy_SMIF_HibernateCallback(cy_stc_syspm_callback_params_t *callbackParams, cy_en_syspm_callback_mode_t mode)
{
    cy_en_syspm_status_t retStatus = CY_SYSPM_SUCCESS;

    CY_ASSERT_L1(NULL != callbackParams);

    SMIF_Type *locBase = (SMIF_Type *) callbackParams->base;
    cy_stc_smif_context_t *locContext = (cy_stc_smif_context_t *) callbackParams->context;

    switch (mode)
    {
    case CY_SYSPM_CHECK_READY:
    {
        /* Check if API is not busy executing transfer operation
        * If SPI bus is not busy, all data elements are transferred on
        * the bus from the TX FIFO and shifter and the RX FIFIOs is
        * empty - the SPI is ready enter Deep Sleep.
        */
        bool checkFail = (CY_SMIF_RX_BUSY == (cy_en_smif_txfr_status_t)
                          Cy_SMIF_GetTransferStatus(locBase, locContext));
        checkFail = (Cy_SMIF_BusyCheck(locBase)) || checkFail;
        checkFail = (Cy_SMIF_GetMode(locBase) == CY_SMIF_MEMORY) || checkFail;

        if (checkFail)
        {
            retStatus = CY_SYSPM_FAIL;

        }
        else
        {
            retStatus = CY_SYSPM_SUCCESS;
#if (CY_IP_MXSMIF_VERSION == 5u) || (CY_IP_MXSMIF_VERSION == 4u)
            if ((SMIF_CORE_Type *)locBase == (SMIF_CORE_Type *)SMIF0_CORE0)
            {
                (void)Cy_SysClk_ClkHfDisable(CY_SMIF_CORE_0_HF);
            }
            if ((SMIF_CORE_Type *)locBase == (SMIF_CORE_Type *)SMIF0_CORE1)
            {
                (void)Cy_SysClk_ClkHfDisable(CY_SMIF_CORE_1_HF);
            }
#endif
            Cy_SMIF_Disable(locBase);
        }
        /* Add check memory that memory not in progress */
    }
    break;

    case CY_SYSPM_CHECK_FAIL:
    {
        /* Other driver is not ready for Deep Sleep. Restore Active mode
        * configuration.
        */
#if (CY_IP_MXSMIF_VERSION == 5u) || (CY_IP_MXSMIF_VERSION == 4u)
        if ((SMIF_CORE_Type *)locBase == (SMIF_CORE_Type *)SMIF0_CORE0)
        {
            (void)Cy_SysClk_ClkHfEnable(CY_SMIF_CORE_0_HF);
        }
        if ((SMIF_CORE_Type *)locBase == (SMIF_CORE_Type *)SMIF0_CORE1)
        {
            (void)Cy_SysClk_ClkHfEnable(CY_SMIF_CORE_1_HF);
        }
#endif
        Cy_SMIF_Enable(locBase, locContext);

    }
    break;

    case CY_SYSPM_BEFORE_TRANSITION:
    {
        /* Put external memory in low power mode */
    }
    break;

    case CY_SYSPM_AFTER_TRANSITION:
    {
#if (CY_IP_MXSMIF_VERSION == 5u) || (CY_IP_MXSMIF_VERSION == 4u)
        if ((SMIF_CORE_Type *)locBase == (SMIF_CORE_Type *)SMIF0_CORE0)
        {
            (void)Cy_SysClk_ClkHfEnable(CY_SMIF_CORE_0_HF);
        }
        if ((SMIF_CORE_Type *)locBase == (SMIF_CORE_Type *)SMIF0_CORE1)
        {
            (void)Cy_SysClk_ClkHfEnable(CY_SMIF_CORE_1_HF);
        }
#endif

        Cy_SMIF_Enable(locBase, locContext);
        /* Put external memory in active mode */

    }
    break;

    default:
        retStatus = CY_SYSPM_FAIL;
        break;
    }

    return (retStatus);
}


#if (CY_IP_MXSMIF_VERSION == 2U) || (CY_IP_MXSMIF_VERSION >= 4U) || defined (CY_DOXYGEN)
/*******************************************************************************
* Function Name: Cy_SMIF_Set_DelayTapSel
****************************************************************************//**
*
* This function sets delay tap number for the SMIF master clock which is common
* for all memory devices connected.
*
* \param base
* Holds the base address of the SMIF block or SMIF_DEVICE block registers.
*
* \param tapSel
* delay tap selection to be set
*
* \return status (see \ref cy_en_smif_status_t).
*
* \snippet smif/snippet/main.c snippet_Cy_SMIF_Set_DelayTapSel
*******************************************************************************/
cy_en_smif_status_t Cy_SMIF_Set_DelayTapSel(SMIF_Type *base, uint8_t tapSel)
{
    if (tapSel > (SMIF_DELAY_TAPS_NR - 1U))
    {
        return CY_SMIF_BAD_PARAM;
    }

