PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_smif.c
#if (CY_IP_MXSMIF_VERSION == 2U)
    SMIF_DELAY_TAP_SEL(base) = tapSel;
#else
    SMIF_CTL2(base) &= ~SMIF_CORE_CTL2_MDL_TAP_SEL_Msk;
    SMIF_CTL2(base) |= _VAL2FLD(SMIF_CORE_CTL2_MDL_TAP_SEL, tapSel);
#endif

    return CY_SMIF_SUCCESS;
}

/*******************************************************************************
* Function Name: Cy_SMIF_Get_DelayTapSel
****************************************************************************//**
*
* This function returns delay tap number which has been set for the SMIF.
*
* \param base
* Holds the base address of the SMIF block or SMIF_DEVICE block registers.
*
* \return read tap selection
*
* \snippet smif/snippet/main.c snippet_Cy_SMIF_Set_DelayTapSel
*******************************************************************************/
uint8_t Cy_SMIF_Get_DelayTapSel(SMIF_Type *base)
{
#if (CY_IP_MXSMIF_VERSION == 2U)
    return (uint8_t)(SMIF_DELAY_TAP_SEL(base));
#else
    return (uint8_t)(_FLD2VAL(SMIF_CORE_CTL2_MDL_TAP_SEL, SMIF_CTL2(base)));
#endif
}
#endif /*(CY_IP_MXSMIF_VERSION==2) || (CY_IP_MXSMIF_VERSION >= 5U)*/

#if (CY_IP_MXSMIF_VERSION >= 6U) || defined (CY_DOXYGEN)
/*******************************************************************************
* Function Name: Cy_SMIF_InitCache
****************************************************************************//**
*
* This function initializes SMIF internal CACHE with user provided configuration \ref cy_stc_smif_cache_config_t.
*
* \param base
* Holds the base address of the SMIF block.
*
* \param cache_config
* Contains the configuration information to configure SMIF internal Cache.
*
* \return Returns result of CACHE configuration.
*
* \snippet smif/snippet/main.c snippet_Cy_SMIF_InitCache
*******************************************************************************/
cy_en_smif_status_t Cy_SMIF_InitCache(SMIF_CACHE_BLOCK_Type *base, const cy_stc_smif_cache_config_t *cache_config)
{

    if ((base == NULL) || (cache_config == NULL))
    {
        return CY_SMIF_BAD_PARAM;
    }

#if defined (COMPONENT_SECURE_DEVICE)
    cy_en_smif_status_t result = CY_SMIF_SUCCESS;

    volatile uint32_t *region_base_address = &(base->MMIO.REGION0_BASE);

    if (cache_config->cache_region_0.enabled)
    {
        if ((cache_config->cache_region_0.start_address % CY_SMIF_CACHE_SUB_REGION_ALIGN_IN_BYTES == 0U) && (cache_config->cache_region_0.end_address % CY_SMIF_CACHE_SUB_REGION_ALIGN_IN_BYTES == 0U))
        {
            *(region_base_address++) = cache_config->cache_region_0.start_address;
            *(region_base_address++) = (uint32_t)(_VAL2FLD(SMIF_CACHE_BLOCK_MMIO_REGION0_LIMIT_ENABLE, 1U) |
                                                  _VAL2FLD(SMIF_CACHE_BLOCK_MMIO_REGION0_LIMIT_ATTR, (uint32_t)cache_config->cache_region_0.cache_attributes) |
                                                  cache_config->cache_region_0.end_address);
        }
        else
        {
            result = CY_SMIF_BAD_PARAM;
        }
    }
    if (cache_config->cache_region_1.enabled)
    {
        region_base_address = &(base->MMIO.REGION1_BASE);
        if ((cache_config->cache_region_1.start_address % CY_SMIF_CACHE_SUB_REGION_ALIGN_IN_BYTES == 0U) && (cache_config->cache_region_1.end_address % CY_SMIF_CACHE_SUB_REGION_ALIGN_IN_BYTES == 0U))
        {
            *(region_base_address++) = cache_config->cache_region_1.start_address;
            *(region_base_address++) = (uint32_t)(_VAL2FLD(SMIF_CACHE_BLOCK_MMIO_REGION0_LIMIT_ENABLE, 1U) |
                                                  _VAL2FLD(SMIF_CACHE_BLOCK_MMIO_REGION0_LIMIT_ATTR, (uint32_t)cache_config->cache_region_1.cache_attributes) |
                                                  cache_config->cache_region_1.end_address);
        }
        else
        {
            result = CY_SMIF_BAD_PARAM;
        }
    }
    if (cache_config->cache_region_2.enabled)
    {
        region_base_address = &(base->MMIO.REGION2_BASE);
        if ((cache_config->cache_region_2.start_address % CY_SMIF_CACHE_SUB_REGION_ALIGN_IN_BYTES == 0U) && (cache_config->cache_region_2.end_address % CY_SMIF_CACHE_SUB_REGION_ALIGN_IN_BYTES == 0U))
        {
            *(region_base_address++) = cache_config->cache_region_2.start_address;
            *(region_base_address++) = (uint32_t)(_VAL2FLD(SMIF_CACHE_BLOCK_MMIO_REGION0_LIMIT_ENABLE, 1U) |
                                                  _VAL2FLD(SMIF_CACHE_BLOCK_MMIO_REGION0_LIMIT_ATTR, (uint32_t)cache_config->cache_region_2.cache_attributes) |
                                                  cache_config->cache_region_2.end_address);
        }
        else
        {
            result = CY_SMIF_BAD_PARAM;
        }
    }

    if (cache_config->cache_region_3.enabled)
    {
        region_base_address = &(base->MMIO.REGION3_BASE);
        if ((cache_config->cache_region_3.start_address % CY_SMIF_CACHE_SUB_REGION_ALIGN_IN_BYTES == 0U) && (cache_config->cache_region_3.end_address % CY_SMIF_CACHE_SUB_REGION_ALIGN_IN_BYTES == 0U))
        {
            *(region_base_address++) = cache_config->cache_region_3.start_address;
            *(region_base_address++) = (uint32_t)(_VAL2FLD(SMIF_CACHE_BLOCK_MMIO_REGION0_LIMIT_ENABLE, 1U) |
                                                  _VAL2FLD(SMIF_CACHE_BLOCK_MMIO_REGION0_LIMIT_ATTR, (uint32_t)cache_config->cache_region_3.cache_attributes) |
                                                  cache_config->cache_region_3.end_address);
        }
        else
        {
            result = CY_SMIF_BAD_PARAM;
        }
    }

    if (result != CY_SMIF_BAD_PARAM)
    {
        base->CTRL = (uint32_t)(_VAL2FLD(SMIF_CACHE_BLOCK_CTRL_ENABLE, cache_config->enabled) |
                                _VAL2FLD(SMIF_CACHE_BLOCK_CTRL_ALLOW_NSEC_ENABLE_READ, 1U) |
                                _VAL2FLD(SMIF_CACHE_BLOCK_CTRL_ALLOW_NSEC_MAINT_LINES, 1U) |
                                _VAL2FLD(SMIF_CACHE_BLOCK_CTRL_ALLOW_NSEC_NSECSTAT, 1U));

        base->MMIO.MMIO_CACHE_RET_EN = (uint32_t)cache_config->cache_retention_on;
    }
    return result;
#elif (defined(CY_USE_RPC_CALL) && (CY_USE_RPC_CALL == 1))
    cy_rpc_service_args_t rpcInputArgs, rpcOutputArgs;
    cy_en_smif_status_t status = CY_SMIF_BAD_PARAM;

    rpcInputArgs.argc = 3;
    rpcInputArgs.argv[0] = (uint32_t)CY_SECURE_SERVICE_TYPE_SMIF;
    rpcInputArgs.argv[1] = (uint32_t)CY_SECURE_SERVICE_SMIF_CACHE_CONFIGURE;
    rpcInputArgs.argv[2] = (uint32_t)base;

    cy_rpc_invec_t in_vec[] =
    {
        { .base = &rpcInputArgs, .len = sizeof(rpcInputArgs) },
        { .base = (void *)cache_config, .len = sizeof(*cache_config) },
    };

